TEMPLATE_BASE/0.1/uxp/check-eligibility.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:wsdl="http://x-road.eu/xsd/connector/service/v1"
    xmlns:iden="http://x-road.eu/xsd/identifiers"
    xmlns:bj="http://gouv.bj/schemas/eligibility/v1">
    
    <soapenv:Header>
        <!-- X-Road Header -->
        <wsdl:client iden:objectType="SUBSYSTEM">
            <iden:xRoadInstance>BJ</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>DIGITAL_MINISTRY</iden:memberCode>
            <iden:subsystemCode>CITIZEN_PORTAL</iden:subsystemCode>
        </wsdl:client>
        
        <wsdl:service iden:objectType="SERVICE">
            <iden:xRoadInstance>BJ</iden:xRoadInstance>
            <iden:memberClass>GOV</iden:memberClass>
            <iden:memberCode>SERVICE_PROVIDER</iden:memberCode>
            <iden:subsystemCode>ELIGIBILITY_CHECK</iden:subsystemCode>
            <iden:serviceCode>checkEligibility</iden:serviceCode>
            <iden:serviceVersion>v1</iden:serviceVersion>
        </wsdl:service>
        
        <wsdl:userId>${metaData.citizen.0}</wsdl:userId>
        <wsdl:id>${metaData.request_id}</wsdl:id>
        <wsdl:protocolVersion>4.0</wsdl:protocolVersion>
    </soapenv:Header>
    
    <soapenv:Body>
        <bj:checkEligibilityRequest>
            <bj:citizenNPI>${metaData.citizen.0}</bj:citizenNPI>
            <bj:serviceId>${serviceId}</bj:serviceId>
            <bj:serviceVersion>${serviceVersion}</bj:serviceVersion>
            <bj:additionalData>
                <bj:email>${data.person.email}</bj:email>
                <bj:phone>${data.person.phone}</bj:phone>
            </bj:additionalData>
        </bj:checkEligibilityRequest>
    </soapenv:Body>
</soapenv:Envelope>
